01_Dummy_cases/01_Dynamic_mesh/dynamicMeshWakeGenerator/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 1);

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"
    
    inlet
    {
        type            fixedValue;
        value           uniform (0 0 1);
    }

    outlet
    {
        type            zeroGradient;
    }

    "(walls_igv|walls_stator)"
    {
        type            noSlip;
    }


    "(nonCoupleIn1|nonCoupleOut2)"    //Parts of static domain
    {
        type            noSlip;
    }

    "(walls_rotor|nonCoupleIn2|nonCoupleOut1)"    //Parts of moving domain
    {
        type            movingWallVelocity;
        value           $internalField;
    }

    nonCouple
    {
        type            movingWallSlipVelocity;
        value           $internalField;
    }


}

// ************************************************************************* //
